
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2024 Summary · Blog</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jane">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sidebar-style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-multipart/multipart.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../Reading/" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://xinchen-jzx.github.io" target="_blank" class="custom-link">About Me</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Part I: Study</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../MLSys/GPUManagement/">
            
                <a href="../MLSys/GPUManagement/">
            
                    
                    GPU Management
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../MLSys/MLServing/">
            
                <a href="../MLSys/MLServing/">
            
                    
                    MLServing
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../MLSys/MLServing/sosp23-vLLM.html">
            
                <a href="../MLSys/MLServing/sosp23-vLLM.html">
            
                    
                    SOSP23 - vLLM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="../MLSys/MLServing/icml23-DejaVu.html">
            
                <a href="../MLSys/MLServing/icml23-DejaVu.html">
            
                    
                    ICML23 - DejaVu
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.3" data-path="../MLSys/MLServing/acl24-LLM_in_a_flash.html">
            
                <a href="../MLSys/MLServing/acl24-LLM_in_a_flash.html">
            
                    
                    ACL24 - LLM in a flash
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.4" data-path="../MLSys/MLServing/sosp24-PowerInfer.html">
            
                <a href="../MLSys/MLServing/sosp24-PowerInfer.html">
            
                    
                    SOSP24 - PowerInfer
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../LLM/">
            
                <a href="../LLM/">
            
                    
                    LLM
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.3.1" data-path="../LLM/LLMModels.html">
            
                <a href="../LLM/LLMModels.html">
            
                    
                    LLM Foundations
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3.2" data-path="../LLM/MLServing.html">
            
                <a href="../LLM/MLServing.html">
            
                    
                    ML Serving
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3.3" data-path="../LLM/neurips17-Transformer.html">
            
                <a href="../LLM/neurips17-Transformer.html">
            
                    
                    NeurIPS17 - Transformer
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">Part II: Life</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../Lover/">
            
                <a href="../Lover/">
            
                    
                    My Lover
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="./">
            
                <a href="./">
            
                    
                    Year-end Summary
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="3.2.1" data-path="2024-summary.html">
            
                <a href="2024-summary.html">
            
                    
                    2024 Summary
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../Reading/">
            
                <a href="../Reading/">
            
                    
                    Reading
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.3.1" data-path="../Reading/My_Altay.html">
            
                <a href="../Reading/My_Altay.html">
            
                    
                    我的阿勒泰
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="../Friends/">
            
                <a href="../Friends/">
            
                    
                    My Friends
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2024 Summary</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2024&#xFF0C;&#x8DEF;&#x6F2B;&#x6F2B;&#x5176;&#x4FEE;&#x8FDC;&#x516E;">2024&#xFF0C;&#x8DEF;&#x6F2B;&#x6F2B;&#x5176;&#x4FEE;&#x8FDC;&#x516E;</h1>
<blockquote>
<p>&#x8DEF;&#x6F2B;&#x6F2B;&#x5176;&#x4FEE;&#x8FDC;&#x516E;&#xFF0C;&#x543E;&#x5C06;&#x4E0A;&#x4E0B;&#x6C42;&#x7D22;&#x3002;</p>
</blockquote>
<p>&#x66FE;&#x5B50;&#x66F0;&#x201C;&#x543E;&#x65E5;&#x4E09;&#x7701;&#x543E;&#x751F;&#xFF0C;&#x4E3A;&#x4EBA;&#x8C0B;&#x800C;&#x4E0D;&#x5FE0;&#x4E4E;&#xFF1F;&#x4E0E;&#x670B;&#x53CB;&#x4EA4;&#x800C;&#x4E0D;&#x4FE1;&#x4E4E;&#xFF1F;&#x4F20;&#x4E0D;&#x4E60;&#x4E4E;&#xFF1F;&#x201D;2024&#x5E74;&#x53BB;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x5916;&#x9762;&#x4E16;&#x754C;&#x7684;&#x5E7F;&#x9614;&#xFF0C;&#x4E5F;&#x9047;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4E5F;&#x53D1;&#x73B0;&#x4E86;&#x81EA;&#x5DF1;&#x5F88;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x60F3;&#x3002;&#x987B;&#x77E5;&#x5C11;&#x65F6;&#x51CC;&#x4E91;&#x5FD7;&#xFF0C;&#x66FE;&#x8BB8;&#x4EBA;&#x95F4;&#x7B2C;&#x4E00;&#x6D41;&#x3002;</p>
<h2 id="&#x2B05;&#xFE0F;-&#x56DE;&#x987E;2024">&#x2B05;&#xFE0F; &#x56DE;&#x987E;2024</h2>
<blockquote>
<p>&#x5929;&#x5730;&#x751F;&#x541B;&#x5B50;&#xFF0C;&#x541B;&#x5B50;&#x7406;&#x5929;&#x5730;&#x3002;</p>
</blockquote>
<p>&#x5199;&#x5E74;&#x7EC8;&#x603B;&#x7ED3;&#x4E4B;&#x524D;&#xFF0C;&#x611F;&#x6168;&#x4E07;&#x5343;&#xFF0C;&#x4F46;&#x771F;&#x5230;&#x8981;&#x5199;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5374;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4E0B;&#x7B14;&#xFF0C;&#x90A3;&#x5C31;&#x968F;&#x4FBF;&#x804A;&#x804A;&#x5427;&#x3002;</p>
<h3 id="&#x5B66;&#x4E60;">&#x5B66;&#x4E60;</h3>
<p>&#x5BF9;&#x4E8E;&#x6211;&#x800C;&#x8A00;2024&#x5E74;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x5C31;&#x662F;<strong>&#x4FDD;&#x7814;</strong>&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;2024&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#x5C31;&#x5F00;&#x59CB;&#x4FDD;&#x7814;&#x63A8;&#x514D;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4ECA;&#x5E74;&#x5927;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5728;&#x4E3A;&#x4E86;&#x4FDD;&#x7814;&#x505A;&#x51C6;&#x5907; -- &#x75AF;&#x72C2;&#x5237;&#x7EE9;&#x70B9;&#x3001;&#x6253;&#x6BD4;&#x8D5B;&#x3001;&#x8054;&#x7CFB;&#x8001;&#x5E08;&#x5B9E;&#x4E60;&#x7B49;&#x7B49;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x53BB;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x6EE1;&#x610F;&#x7684;&#x8BFE;&#x9898;&#x7EC4;&#x5566;&#xFF01;&#x5728;&#x8FD9;&#x8FC7;&#x7A0B;&#x4E2D;&#x6211;&#x5F88;&#x5E78;&#x8FD0;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5FD7;&#x540C;&#x9053;&#x5408;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x548C;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x5408;&#x4F5C;&#x4E86;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x4E00;&#x8D77;&#x71AC;&#x591C;&#xFF0C;&#x4E00;&#x8D77;&#x4E3A;&#x6BD4;&#x8D5B;&#x4E2D;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#x800C;&#x6B22;&#x547C;&#x96C0;&#x8DC3;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53D6;&#x5F97;&#x4E86;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x4E0D;&#x9519;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x4F46;&#x4E5F;&#x7559;&#x4E0B;&#x4E86;&#x9057;&#x61BE;&#x3002;&#x4F46;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#xFF0C;&#x4E5F;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x9057;&#x61BE;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E00;&#x76F4;&#x6FC0;&#x52B1;&#x7740;&#x6211;&#x4EEC;&#x4E0B;&#x6B21;&#x8981;&#x66F4;&#x52A0;&#x52AA;&#x529B;&#x3001;&#x601D;&#x8003;&#x66F4;&#x52A0;&#x5468;&#x5230;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x81EA;&#x6211;&#x8FDB;&#x6B65;&#x3002;</p>
<h4 id="&#x6BD4;&#x8D5B;">&#x6BD4;&#x8D5B;</h4>
<p>2024&#x5E74;&#x5E74;&#x521D;&#x7684;<strong>&#x6570;&#x6A21;&#x7F8E;&#x8D5B;</strong>&#xFF0C;&#x5F53;&#x65F6;&#x548C;&#x534E;&#x4ED4;&#x3001;&#x74DC;&#x54E5;&#x4E00;&#x76F4;&#x51C6;&#x5907;&#x8FD9;&#x4E2A;&#x6BD4;&#x8D5B;&#xFF0C;&#x8BFB;&#x7F8E;&#x8D5B;&#x4F18;&#x79C0;&#x8BBA;&#x6587;&#xFF0C;&#x6BCF;&#x5929;&#x6C47;&#x62A5;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x8FD9;&#x6B21;&#x7F8E;&#x8D5B;&#x7684;&#x5FC3;&#x5F97;&#x60F3;&#x6CD5;&#x3002;&#x6BD4;&#x8D5B;&#x7684;&#x65F6;&#x5019;&#x548C;&#x4ED6;&#x4EEC;&#x4E00;&#x76F4;&#x5F00;&#x7740;&#x817E;&#x8BAF;&#x4F1A;&#x8BAE;&#x4EA4;&#x6D41;&#xFF0C;&#x8FC7;&#x7A0B;&#x5F7C;&#x6B64;&#x9F13;&#x52B1;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6700;&#x540E;&#x4E00;&#x5929;&#xFF0C;&#x71AC;&#x4E86;&#x4E00;&#x6574;&#x665A;&#xFF08;&#x5DEE;&#x70B9;g&#x4E86;&#xFF09;&#xFF0C;&#x867D;&#x8BF4;&#x7ED3;&#x679C;&#x4E0D;&#x662F;&#x5F88;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#xFF08;&#x545C;&#x545C;&#x545C;&#x545C;&#xFF09;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x5F88;&#x611F;&#x8C22;&#x8FD9;&#x6B21;&#x7ECF;&#x5386;&#xFF0C;&#x6211;&#x4EEC;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x66F4;&#x52A0;&#x9ED8;&#x5951;&#x4E86;&#x3002;&#x8D34;&#x4E00;&#x5F20;&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x89C6;&#x9891;&#x7684;&#x56FE;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x3002;</p>
<p><img src="../assets/life/2024-summary/&#x7F8E;&#x8D5B;.jpg" alt="&#x7F8E;&#x8D5B;"></p>
<p>4&#x6708;&#x4EFD;&#x7684;<strong>&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7ADE;&#x8D5B;</strong> -- &#x84DD;&#x6865;&#x676F;&#x548C;&#x5929;&#x68AF;&#x8D5B;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x51E0;&#x6B21;&#x6BD4;&#x8D5B;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x786E;&#x5B9E;&#x4E0D;&#x9002;&#x5408;&#x7B97;&#x6CD5;&#x8FD9;&#x4E2A;&#x8D5B;&#x9053;&#xFF0C;&#x8981;&#x4E00;&#x76F4;&#x5237;&#x9898;&#x5237;&#x9898;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x9AD8;&#x4E2D;&#x4E09;&#x5E74;&#x4E00;&#x76F4;&#x5237;&#x9898;&#xFF0C;&#x5BF9;&#x5237;&#x9898;&#x4EA7;&#x751F;&#x9634;&#x5F71;&#x4E86;&#x5427;&#x1F62D;&#x3002;&#x4F46;&#x7ED3;&#x679C;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x6BD4;&#x8F83;&#x6EE1;&#x610F;&#x3002;&#xFF08;&#x56FE;&#x597D;&#x50CF;&#x627E;&#x4E0D;&#x5230;&#x4E86;&#x1F62D;&#xFF09;</p>
<p>6&#x6708;&#x4EFD;&#x7684;<strong>&#x7F51;&#x7EDC;&#x6311;&#x6218;&#x8D5B;</strong>&#xFF0C;&#x548C;&#x5B9A;&#x4E2D;&#x5408;&#x4F5C;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x5F53;&#x65F6;&#x6B63;&#x597D;&#x4E00;&#x987F;&#x4E8B;&#x60C5;&#x5806;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x6BD4;&#x8D5B;&#x5F53;&#x65F6;&#x51C6;&#x5907;&#x7684;&#x4E5F;&#x4E0D;&#x5145;&#x5206;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E5F;&#x83B7;&#x5F97;&#x4E86;&#x4E0D;&#x9519;&#x7684;&#x6210;&#x7EE9;&#x3002;&#xFF08;&#x8FD9;&#x4E2A;&#x4E5F;&#x6CA1;&#x62CD;&#x7167;&#x1F62D;&#xFF09;</p>
<p>7&#x6708;&#x4EFD;&#x7684;<strong>&#x96C6;&#x521B;&#x8D5B;</strong>&#xFF0C;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x786C;&#x4EF6;&#x4E0D;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x65F6;&#x51C6;&#x5907;&#x8FD9;&#x4E2A;&#x6BD4;&#x8D5B;&#x7684;&#x65F6;&#x5019;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x5B66;&#x7684;&#x786C;&#x4EF6;&#x77E5;&#x8BC6;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F88;&#x611F;&#x8C22;&#x723D;&#x5B50;&#x548C;&#x712F;&#x54E5;&#xFF0C;&#x5927;&#x4F6C;&#x5E26;&#x6211;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x53D6;&#x5F97;&#x4E86;&#x76F8;&#x5BF9;&#x4E0D;&#x9519;&#x7684;&#x6210;&#x7EE9;&#x3002;&#xFF08;&#x5F53;&#x65F6;&#x597D;&#x50CF;&#x4E5F;&#x5FD8;&#x8BB0;&#x62CD;&#x7167;&#x4E86;&#x1F62D;&#xFF09;</p>
<p>8&#x6708;&#x4EFD;&#x7684;<strong>&#x7F16;&#x8BD1;&#x7ADE;&#x8D5B;</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x8D5B;&#x6211;&#x4EEC;&#x5C0F;&#x7EC4;&#x51C6;&#x5907;&#x4E86;&#x633A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x4ECA;&#x5E74;3&#x6708;&#x4EFD;&#x4E00;&#x76F4;&#x5230;8&#x6708;&#x4EFD;&#xFF0C;&#x4F46;&#x662F;&#x4E34;&#x5230;&#x6BD4;&#x8D5B;&#x622A;&#x6B62;&#x63D0;&#x4EA4;&#x65F6;&#x5374;&#x63A5;&#x8FDE;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x4E5F;&#x6709;&#x70B9;&#x5DEE;&#x5F3A;&#x4EBA;&#x610F;&#xFF0C;&#x4E0D;&#x8FC7;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6BD4;&#x8D5B;&#x5BF9;&#x7CFB;&#x7EDF;&#x4E5F;&#x4EA7;&#x751F;&#x4E86;&#x6D53;&#x539A;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x5C0F;&#x7EC4;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x9ED8;&#x5951;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x660E;&#x5E74;&#x53EF;&#x4EE5;&#x5F25;&#x8865;&#x8FD9;&#x4E2A;&#x9057;&#x61BE;&#x3002;&#xFF08;&#x4E0D;&#x8FC7;&#x6709;&#x4E00;&#x8BF4;&#x4E00;&#xFF0C;&#x676D;&#x5DDE;&#x90A3;&#x8FB9;&#x771F;&#x662F;&#x7F8E;&#x98DF;&#x8352;&#x6F20;&#xFF0C;&#x597D;&#x96BE;&#x5403;&#x1F62D;&#xFF09;&#x3002;&#x8D34;&#x4E2A;&#x56FE;&#x3002;</p>
<p><img src="../assets/life/2024-summary/Compiler.jpg" alt="Compiler"></p>
<p>&#x4ECA;&#x5E74;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6BD4;&#x8D5B;&#x5C31;&#x662F;11&#x6708;&#x4EFD;&#x7684;<strong>&#x7EA2;&#x5C71;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</strong>&#x4E86;&#xFF0C;&#x5F00;&#x59CB;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#x5B66;&#x4E60;Rust&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;Rust&#x7B2C;X&#x6B21;&#x5165;&#x95E8;&#x1F602;&#x3002;&#x8FD9;&#x6B21;&#x548C;&#x725B;&#x4ED4;&#x4E5F;&#x7B97;&#x5408;&#x4F5C;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x5F53;&#x7136;&#x660E;&#x5E74;&#x4F1A;&#x7EE7;&#x7EED;&#x548C;&#x725B;&#x4ED4;&#x5408;&#x4F5C;&#xFF0C;&#x5E0C;&#x671B;&#x5728;&#x660E;&#x5E74;&#x7684;&#x5168;&#x56FD;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6BD4;&#x8D5B;&#x4E2D;&#x62FF;&#x5230;&#x66F4;&#x597D;&#x7684;&#x540D;&#x6B21;&#x3002;&#x8D34;&#x4E2A;&#x56FE;&#x3002;</p>
<p><img src="../assets/life/2024-summary/OS.jpg" alt="OS"></p>
<h4 id="&#x8BBA;&#x6587;">&#x8BBA;&#x6587;</h4>
<p>&#x4ECA;&#x5E74;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x523B;&#x7684;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x53D1;&#x8868;&#x8BBA;&#x6587;&#xFF0C;&#x5168;&#x7A0B;&#x53C2;&#x4E0E;&#x4E86;&#x8BBA;&#x6587;&#x7684;&#x5168;&#x8FC7;&#x7A0B;&#xFF0C;&#x8BBA;&#x6587;ddl&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x548C;&#x5E08;&#x54E5;&#x3001;&#x8001;&#x5E08;&#x8BA8;&#x8BBA;&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x7684;&#x5408;&#x7406;&#x6027;&#x3001;&#x8BBA;&#x6587;&#x7ED3;&#x6784;&#x7684;&#x6DA6;&#x8272;&#x7B49;&#x7B49;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#x662F;&#x4E00;&#x6B21;&#x6BD4;&#x8F83;&#x5168;&#x65B0;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x5F88;&#x5F00;&#x5FC3;&#x53EF;&#x4EE5;&#x548C;&#x7530;&#x8001;&#x5E08;&#x5408;&#x4F5C;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x77E5;&#x8BC6;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x88AB;Nips&#x5F55;&#x53D6;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x5F00;&#x5FC3;&#x3002;&#x8D34;&#x4E2A;&#x56FE;&#x3002;</p>
<p><img src="../assets/life/2024-summary/Nips2025.png" alt="Nips25"></p>
<h3 id="&#x751F;&#x6D3B;">&#x751F;&#x6D3B;</h3>
<blockquote>
<p>&#x8BFB;&#x4E07;&#x5377;&#x4E66;&#xFF0C;&#x884C;&#x4E07;&#x91CC;&#x8DEF;&#x3002;</p>
</blockquote>
<p>2024&#x5E74;&#x501F;&#x7740;&#x590F;&#x4EE4;&#x8425;&#x3001;&#x6BD4;&#x8D5B;&#x7B49;&#x8BF8;&#x591A;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x53BB;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x6CA1;&#x770B;&#x5230;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x6709;&#x8DA3;&#x7684;&#x4EBA;&#xFF0C;&#x5F88;&#x5E78;&#x8FD0;&#x3002;</p>
<h4 id="&#x805A;&#x6563;">&#x805A;&#x6563;</h4>
<p>&#x9996;&#x5148;&#x662F;&#x4ECA;&#x5E74;&#x548C;&#x5BB6;&#x7684;&#x89C1;&#x9762;&#x660E;&#x663E;&#x591A;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x4E00;&#x8D77;&#x53BB;&#x897F;&#x5B89;&#x65C5;&#x6E38;&#xFF0C;&#x722C;&#x4E86;&#x534E;&#x5C71;&#xFF0C;&#x770B;&#x4E86;&#x57CE;&#x5899;&#x3001;&#x5927;&#x96C1;&#x5854;&#x3001;&#x5927;&#x5510;&#x4E0D;&#x591C;&#x57CE;&#x3001;&#x5175;&#x9A6C;&#x4FD1;&#x7B49;&#x7B49;&#x7B49;&#xFF0C;&#x5403;&#x4E86;&#x8089;&#x5939;&#x998D;&#x3001;&#x6CB9;&#x6CFC;&#x9762;&#x3001;biangbiang&#x9762;&#x3001;&#x5C90;&#x5C71;&#x81CA;&#x5B50;&#x9762;&#x7B49;&#x7B49;&#x7B49;&#xFF1B;&#x5728;&#x5317;&#x4EAC;&#x4E00;&#x8D77;&#x73A9;&#x800D;&#xFF0C;&#x901B;&#x4E86;&#x6E05;&#x534E;&#x3001;&#x5317;&#x5927;&#xFF0C;&#x770B;&#x4E86;&#x9890;&#x548C;&#x56ED;&#xFF1B;&#x7545;&#x8C08;&#x4EBA;&#x751F;&#x7406;&#x60F3;......&#x4E4B;&#x524D;&#x548C;&#x548C;&#x5BB6;&#x4E00;&#x76F4;&#x662F;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x7545;&#x8C08;&#x4EBA;&#x751F;&#x7406;&#x60F3;&#xFF0C;&#x5F7C;&#x6B64;&#x9F13;&#x52B1;&#xFF0C;&#x5F88;&#x9AD8;&#x5174;&#x9047;&#x5230;&#x4E86;&#x5BB6;&#xFF0C;&#x548C;&#x4ED6;&#x6210;&#x4E3A;&#x4E86;&#x4EBA;&#x751F;&#x77E5;&#x5DF1;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x6211;&#x4EEC;&#x4FE9;&#x6162;&#x6162;&#x7684;&#x90FD;&#x4F1A;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x6210;&#x4E3A;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x7684;&#x4EBA;&#x3002;</p>
<p><img src="../assets/life/2024-summary/peking.jpg" alt="Peking"></p>
<p>&#x4ECA;&#x5E74;&#x5E74;&#x521D;&#x548C;&#x6731;&#x540C;&#x5B66;&#x4E00;&#x8D77;&#x53BB;&#x5230;&#x4E86;&#x6842;&#x6797;&#x90A3;&#x8FB9;&#x65C5;&#x6E38;&#x73A9;&#x800D;&#xFF0C;&#x5F53;&#x65F6;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x4E34;&#x65F6;&#x8D77;&#x610F;&#xFF08;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x6765;&#x4E86;&#x4E00;&#x573A;&#x8BF4;&#x8D70;&#x5C31;&#x8D70;&#x7684;&#x65C5;&#x884C;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x51C6;&#x5907;&#x7684;&#x5C31;&#x6BD4;&#x8F83;&#x4ED3;&#x4FC3;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x58EE;&#x9614;&#x7684;&#x98CE;&#x666F;&#x3002;</p>
<p><img src="../assets/life/2024-summary/birth1.jpg" alt="Birth1"></p>
<p><img src="../assets/life/2024-summary/birth2.jpg" alt="Birth2"></p>
<h2 id="&#x5C55;&#x671B;2025">&#x5C55;&#x671B;2025</h2>
<blockquote>
<p>&#x6211;&#x5C06;&#x7EE7;&#x7EED;&#x5BFB;&#x627E;&#xFF0C;&#x5C31;&#x7B97;&#x8FD9;&#x65E0;&#x5C3D;&#x7684;&#x661F;&#x8FB0;&#x4EE4;&#x6211;&#x7684;&#x5BFB;&#x627E;&#x5E0C;&#x671B;&#x6E3A;&#x832B;&#xFF0C;&#x5C31;&#x7B97;&#x6211;&#x5C06;&#x5355;&#x67AA;&#x5339;&#x9A6C;&#x3002;</p>
</blockquote>
<p>&#x8A00;&#x5FF5;&#x541B;&#x5B50;&#xFF0C;&#x6E29;&#x5176;&#x5982;&#x7389;&#x3002;</p>
<p>&#x5728;2025&#x5E74;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x6B64;&#x5E74;&#x8F7B;&#x7684;&#x6211;&#xFF0C;&#x5F88;&#x60F3;&#x8981;&#x53BB;&#x6539;&#x53D8;&#x4E16;&#x754C;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x70ED;&#x7231;&#x3002;&#x987B;&#x77E5;&#x5C11;&#x65F6;&#x51CC;&#x4E91;&#x5FD7;&#xFF0C;&#x66FE;&#x8BB8;&#x4EBA;&#x95F4;&#x7B2C;&#x4E00;&#x6D41;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Year-end Summary">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../Reading/" class="navigation navigation-next " aria-label="Next page: Reading">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2024 Summary","level":"3.2.1","depth":2,"next":{"title":"Reading","level":"3.3","depth":1,"path":"Reading/README.md","ref":"Reading/README.md","articles":[{"title":"我的阿勒泰","level":"3.3.1","depth":2,"path":"Reading/My_Altay.md","ref":"Reading/My_Altay.md","articles":[]}]},"previous":{"title":"Year-end Summary","level":"3.2","depth":1,"path":"life/README.md","ref":"life/README.md","articles":[{"title":"2024 Summary","level":"3.2.1","depth":2,"path":"life/2024-summary.md","ref":"life/2024-summary.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","back-to-top-button","chapter-fold","splitter","sidebar-style","insert-logo","github","copy-code-button","advanced-emoji","multipart","expandable-chapters","theme-comscore","katex"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"sidebar-style":{"author":"","title":"zexin's World"},"chapter-fold":{},"github":{"url":"https://github.com/xinchen-jzx"},"splitter":{},"search-pro":{},"multipart":{},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"back-to-top-button":{},"copy-code-button":{},"advanced-emoji":{"embedEmojis":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 100px; min-height: 30px","url":"https://xinchen-jzx.github.io/assets/img/avatar.jpg"},"expandable-chapters":{}},"theme":"default","author":"Jane","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Blog","links":{"sidebar":{"About Me":"https://xinchen-jzx.github.io"}},"gitbook":"*","description":"zexin's Blog"},"file":{"path":"life/2024-summary.md","mtime":"2025-01-10T15:13:08.523Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2025-01-13T13:57:12.639Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sidebar-style/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

